autoconf
automake
build-essential
curl
file
git
heroku
htop
libffi-dev
libgl1-mesa-dev
libglu1-mesa-dev
libncurses-dev
libpq-dev
libreadline-dev
libssh-dev
libssl-dev
libtool
libxslt-dev
libyaml-dev
m4
python-setuptools
silversearcher-ag
software-properties-common
tmux
unixodbc-dev
vim
zsh
