# taps
tap 'caskroom/cask'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/versions'
tap 'jingweno/ccat'
tap 'yudai/gotty'

# casks
brew 'brew-cask'
cask 'launchrocket'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'

# editor
brew 'vim'

# cli
brew 'carthage'
brew 'ccat'
brew 'ctags'
brew 'git'
brew 'gotty'
brew 'heroku-toolbelt'
brew 'httpie'
brew 'ngrok'
brew 'pgcli'
brew 'solr'
brew 'the_silver_searcher'

# ops
brew 'homebrew/versions/ansible18'
brew 'terraform'
brew 'nginx'

# language
brew 'php56'

# db
brew 'postgresql'
brew 'sqlite'
brew 'redis'
brew 'mysql'
brew 'couchdb'

# system
brew 'autoconf'
brew 'automake'
brew 'freetype'
brew 'gdbm'
brew 'gmp'
brew 'icu4c'
brew 'imagemagick'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'lz4'
brew 'ncurses'
brew 'nspr'
brew 'openssl'
brew 'pandoc'
brew 'pcre'
brew 'pkg-config'
brew 'python'
brew 'readline'
brew 'snappy'
brew 'spidermonkey'
brew 'unixodbc'
brew 'watchman'
brew 'wxmac'
brew 'xz'
