# taps
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'jingweno/ccat'
tap 'railwaycat/emacsmacport'

# casks
brew 'brew-cask'
cask 'launchrocket'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'

# editor
brew 'vim'
brew 'emacs-mac'

# cli
brew 'git'
brew 'ccat'
brew 'httpie'
brew 'heroku-toolbelt'
brew 'pgcli'
brew 'ngrok'
brew 'the_silver_searcher'

# ops
brew 'ansible'
brew 'terraform'

# db
brew 'rethinkdb'
brew 'influxdb'
brew 'couchdb'
brew 'mysql'
brew 'postgresql'
brew 'redis'
brew 'solr'

# languages/platforms
brew 'go'
brew 'erlang'
brew 'elixir'
brew 'ruby'
brew 'node'

# system
brew 'imagemagick'
brew 'openssl'
brew 'autoconf'
brew 'automake'
brew 'freetype'
brew 'libpng'
brew 'libtiff'
brew 'gmp'
brew 'icu4c'
brew 'jpeg'
brew 'libtool'
brew 'libyaml'
brew 'lz4'
brew 'nspr'
brew 'pandoc'
brew 'pcre'
brew 'pkg-config'
brew 'readline'
brew 'snappy'
brew 'spidermonkey'
brew 'unixodbc'
brew 'watchman'
brew 'wxmac'
brew 'xz'
