# taps
tap 'homebrew/bundle'
tap 'mike-engel/jwt-cli'

# shell
brew 'fish'

# casks
cask 'google-cloud-sdk'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'

# editor
brew 'tmux'
brew 'vim'

# cli
brew 'awscli'
brew 'bat'
brew 'ccat'
brew 'chrome-cli'
brew 'cloc'
brew 'croc'
brew 'ctags'
brew 'direnv'
brew 'fblog'
brew 'git'
brew 'git-lfs'
brew 'gradle'
brew 'htop'
brew 'httpie'
brew 'httpstat'
brew 'hyperfine'
brew 'jq'
brew 'jwt-cli'
brew 'mosh'
brew 'the_silver_searcher'
brew 'tree'
brew 'wrk'

# system
brew 'autoconf'
brew 'autogen'
brew 'automake'
brew 'bison'
brew 'cmake'
brew 'coreutils'
brew 'freetype'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'gmp'
brew 'icu4c'
brew 'imagemagick'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'krb5'
brew 'libedit'
brew 'libgd'
brew 'libiconv'
brew 'libjpeg'
brew 'libogg'
brew 'libpng'
brew 'libpq'
brew 'libsodium'
brew 'libtiff'
brew 'libtool'
brew 'libuv'
brew 'libvorbis'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'libzip'
brew 'lz4'
brew 'm4'
brew 'mbedtls'
brew 'nasm'
brew 'nspr'
brew 'openal-soft'
brew 'openssl'
brew 'openssl@1.1'
brew 'pandoc'
brew 'pcre'
brew 'pkg-config'
#brew 'qt@5.5'
brew 're2c'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'sdl2'
brew 'shtool'
brew 'snappy'
brew 'sqlite'
brew 'unixodbc'
brew 'watchman'
brew 'wxwidgets'
brew 'xz'
brew 'zlib'
